Обработки/Reports/_СтоимостьПортфеляВДинамикеДоходности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СтоимостьПортфеляВДинамикеДоходности</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СтоимостьПортфеляВДинамикеДоходности/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт	
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Стоимость портфеля в динамике доходности (Сбербанк страхование жизни)",
		"1.06",
		"",
		Истина);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура СформироватьОтчет() Экспорт
	
	// Фиксируем старт операции
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,Клиент,Руководитель"); 	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьОтчет()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	// Формирование		
	Результат.Очистить();
	
	Макет = ПолучитьМакет("Макет");
	
	Шапка			= Макет.ПолучитьОбласть("Шапка");
	ПерваяСтрока	= Макет.ПолучитьОбласть("ПерваяСтрока");
	Строка			= Макет.ПолучитьОбласть("Строка");
	Подвал			= Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	НачалоПериода	= НачалоМесяца(ДобавитьМесяц(Период, -11));
	КонецПериода	= КонецДня(КонецМесяца(Период));
	
	Запрос.УстановитьПараметр("НачалоПериодаГраница",	Новый Граница(НачалоПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериодаГраница",	Новый Граница(КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаN0",					КонецМесяца(ДобавитьМесяц(Период, -12)));
	Запрос.УстановитьПараметр("НачалоПериода",			НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",			КонецПериода);
	Запрос.УстановитьПараметр("Клиент",					Клиент);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Руководитель",			Руководитель);
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _ДанныеДоговора
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецПериода, СчетДоверительногоУправления = &Клиент) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ), ДЕНЬ) КАК Месяц,
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ), ДЕНЬ) > &НачалоПериода КАК РассчитыватьДоходность
		|ПОМЕСТИТЬ _Месяцы
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -1) И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, МЕСЯЦ), ДЕНЬ) КАК Месяц,
		|	МАКСИМУМ(НАЧАЛОПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, ДЕНЬ)) КАК ДатаСЧА
		|ПОМЕСТИТЬ _ДатыСЧА
		|ИЗ
		|	Документ.РегистрацияСтоимостиАктивов КАК РегистрацияСтоимостиАктивов
		|ГДЕ
		|	РегистрацияСтоимостиАктивов.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -1) И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(РегистрацияСтоимостиАктивов.Дата, МЕСЯЦ), ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ФинансовыеПоказатели.Период, МЕСЯЦ), ДЕНЬ) КАК Месяц,
		|	ФинансовыеПоказатели.Значение КАК СЧА
		|ПОМЕСТИТЬ _СЧА
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ФинансовыеПоказатели.Организация = &Организация
		|	И ФинансовыеПоказатели.СубъектАналитики = &Клиент
		|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
		|	И ФинансовыеПоказатели.Период В
		|			(ВЫБРАТЬ
		|				_ДатыСЧА.ДатаСЧА КАК ДатаСЧА
		|			ИЗ
		|				_ДатыСЧА КАК _ДатыСЧА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Период КАК Дата,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ * ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот) КАК Сальдо
		|ПОМЕСТИТЬ _ВводыВыводы
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			&НачалоПериодаГраница,
		|			&КонецПериодаГраница,
		|			День,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &Клиент
		|				И ВидОперацииВводаВыводаДС В (ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтУчредителяВДоверительноеУправление), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствУчредителюПоДоверительномуУправлению), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПФР), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводДляОбеспеченияИОУД), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыплаченыСредстваПФР), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВыводУчредителюДоходаПолученногоОтРазмещения), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПустаяСсылка))) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводыВыводыАктивовВВалютеУчетаОбороты.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Месяцы.Месяц КАК Месяц,
		|	СУММА(_ВводыВыводы.Сальдо) КАК NCF
		|ПОМЕСТИТЬ _NCF
		|ИЗ
		|	_Месяцы КАК _Месяцы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ВводыВыводы КАК _ВводыВыводы
		|		ПО _Месяцы.Месяц > _ВводыВыводы.Дата
		|			И (_Месяцы.РассчитыватьДоходность)
		|
		|СГРУППИРОВАТЬ ПО
		|	_Месяцы.Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Месяцы.Месяц КАК Месяц,
		|	СУММА(_ВводыВыводы.Сальдо * (РАЗНОСТЬДАТ(&ДатаN0, _Месяцы.Месяц, ДЕНЬ) - РАЗНОСТЬДАТ(&ДатаN0, _ВводыВыводы.Дата, ДЕНЬ)) / РАЗНОСТЬДАТ(&ДатаN0, _Месяцы.Месяц, ДЕНЬ)) КАК WCF
		|ПОМЕСТИТЬ _WCF
		|ИЗ
		|	_Месяцы КАК _Месяцы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ВводыВыводы КАК _ВводыВыводы
		|		ПО _Месяцы.Месяц > _ВводыВыводы.Дата
		|			И (_Месяцы.РассчитыватьДоходность)
		|
		|СГРУППИРОВАТЬ ПО
		|	_Месяцы.Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Месяцы.Месяц КАК Месяц,
		|	МИНИМУМ(_ДатыСЧА.Месяц) КАК ДатаСЧАV0
		|ПОМЕСТИТЬ _ДатаСЧАV0
		|ИЗ
		|	_Месяцы КАК _Месяцы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыСЧА КАК _ДатыСЧА
		|		ПО _Месяцы.Месяц > _ДатыСЧА.Месяц
		|
		|СГРУППИРОВАТЬ ПО
		|	_Месяцы.Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Месяцы.Месяц КАК Месяц,
		|	ЕСТЬNULL(_СЧА.СЧА, 0) КАК V0
		|ПОМЕСТИТЬ _V0
		|ИЗ
		|	_Месяцы КАК _Месяцы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатаСЧАV0 КАК _ДатаСЧАV0
		|		ПО (_Месяцы.РассчитыватьДоходность)
		|			И _Месяцы.Месяц = _ДатаСЧАV0.Месяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СЧА КАК _СЧА
		|		ПО (_ДатаСЧАV0.ДатаСЧАV0 = _СЧА.Месяц)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Месяцы.Месяц КАК Месяц,
		|	СУММА(_ВводыВыводы.Сальдо) КАК Сальдо
		|ПОМЕСТИТЬ _СальдоВводовВыводовПоМесяцам
		|ИЗ
		|	_Месяцы КАК _Месяцы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВводыВыводы КАК _ВводыВыводы
		|		ПО (_ВводыВыводы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(_Месяцы.Месяц, МЕСЯЦ) И _Месяцы.Месяц)
		|			И (_Месяцы.РассчитыватьДоходность)
		|
		|СГРУППИРОВАТЬ ПО
		|	_Месяцы.Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Месяцы.Месяц КАК Месяц,
		|	_Месяцы.РассчитыватьДоходность КАК РассчитыватьДоходность,
		|	_СальдоВводовВыводовПоМесяцам.Сальдо КАК Сальдо,
		|	_V0.V0 КАК V0,
		|	_СЧА.СЧА КАК Vi,
		|	_NCF.NCF КАК NCF,
		|	_WCF.WCF КАК WCF
		|ПОМЕСТИТЬ _ДанныеДляРасчета
		|ИЗ
		|	_Месяцы КАК _Месяцы
		|		ЛЕВОЕ СОЕДИНЕНИЕ _V0 КАК _V0
		|		ПО _Месяцы.Месяц = _V0.Месяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СЧА КАК _СЧА
		|		ПО _Месяцы.Месяц = _СЧА.Месяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ _NCF КАК _NCF
		|		ПО _Месяцы.Месяц = _NCF.Месяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ _WCF КАК _WCF
		|		ПО _Месяцы.Месяц = _WCF.Месяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СальдоВводовВыводовПоМесяцам КАК _СальдоВводовВыводовПоМесяцам
		|		ПО _Месяцы.Месяц = _СальдоВводовВыводовПоМесяцам.Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеДоговора.НомерДоговора КАК НомерДоговора,
		|	_ДанныеДоговора.ДатаЗаключения КАК ДатаДоговора,
		|	_ДанныеДоговора.Клиент КАК Клиент
		|ИЗ
		|	_ДанныеДоговора КАК _ДанныеДоговора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеДляРасчета.Месяц КАК Месяц,
		|	ЕСТЬNULL(_ДанныеДляРасчета.Vi, 0) КАК СЧА,
		|	ВЫБОР
		|		КОГДА _ДанныеДляРасчета.РассчитыватьДоходность
		|			ТОГДА ЕСТЬNULL(_ДанныеДляРасчета.Сальдо, 0)
		|		ИНАЧЕ ""-""
		|	КОНЕЦ КАК Сальдо,
		|	ВЫБОР
		|		КОГДА _ДанныеДляРасчета.РассчитыватьДоходность
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(_ДанныеДляРасчета.V0, 0) + ЕСТЬNULL(_ДанныеДляРасчета.WCF, 0) = 0
		|						ТОГДА 0
		|					ИНАЧЕ 100 * (ЕСТЬNULL(_ДанныеДляРасчета.Vi, 0) - ЕСТЬNULL(_ДанныеДляРасчета.V0, 0) - ЕСТЬNULL(_ДанныеДляРасчета.NCF, 0)) / (ЕСТЬNULL(_ДанныеДляРасчета.V0, 0) + ЕСТЬNULL(_ДанныеДляРасчета.WCF, 0))
		|				КОНЕЦ
		|		ИНАЧЕ ""-""
		|	КОНЕЦ КАК Доходность
		|ИЗ
		|	_ДанныеДляРасчета КАК _ДанныеДляРасчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &Руководитель = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ РеквизитыСотрудниковОрганизацииСрезПоследнихРуководитель.Фамилия + "" "" + ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследнихРуководитель.Имя, 1, 1) + ""."" + ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследнихРуководитель.Отчество, 1, 1) + "".""
		|	КОНЕЦ КАК Руководитель
		|ИЗ
		|	РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|			&КонецПериода,
		|			Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И Организация = &Организация
		|				И ЮрФизЛицо = &Руководитель) КАК РеквизитыСотрудниковОрганизацииСрезПоследнихРуководитель";
	#КонецОбласти
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки	= РезультатЗапроса[РезультатЗапроса.Количество()-3].Выбрать();
	Доходность	= РезультатЗапроса[РезультатЗапроса.Количество()-2].Выбрать();
	Подписи		= РезультатЗапроса[РезультатЗапроса.Количество()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Вывод шакпи.
	Если ДанныеШапки.Следующий() Тогда
		
		Шапка.Параметры.Заполнить(ДанныеШапки);
		
		Шапка.Параметры.ДатаДоговора = Формат(ДанныеШапки.ДатаДоговора,	"ДФ='dd.MM.yyyy ''г.'''");
		
	КонецЕсли;
	
	Результат.Вывести(Шапка);
	
	Первая = Истина;
	
	Пока Доходность.Следующий() Цикл
		
		Если Первая Тогда
			Область = ПерваяСтрока;
			
			Первая = Ложь;
		Иначе
			Область = Строка;
		КонецЕсли;
		
		Область.Параметры.Заполнить(Доходность);
		
		Результат.Вывести(Область);
		
	КонецЦикла;
	
	// Вывод подписи.
	Если Подписи.Следующий() Тогда
		Подвал.Параметры.Заполнить(Подписи);
	КонецЕсли;
	
	Результат.Вывести(Подвал);
	
	// Заполняем настройки печати	
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(Результат, ЭтотОбъект.Метаданные().ПолноеИмя(), Истина, ОриентацияСтраницы.Портрет);
	
	// Фиксируем завершение операции
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	
КонецПроцедуры

#Область Автоматизация_формирования_отчета

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Настройки.Добавить("Руководитель");
	
	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	// Заполняем настройки отчета	

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Период = НастройкиОтчета.Период.ДатаОкончания;
	
	ЭтотОбъект.Клиент = НастройкиОтчета.СчетДоверительногоУправления; 
	
	Если НастройкиОтчета.Свойство("Подписант") Тогда
		ЭтотОбъект.Руководитель = НастройкиОтчета.Подписант;
	КонецЕсли;
	
	// Формируем отчет	
	
	СформироватьОтчет();
	
	НастройкиОтчета.Вставить("Результат", ЭтотОбъект.Результат);
	
КонецПроцедуры

#КонецОбласти
